casino/app/Http/Controllers/Web/Frontend/GamesController.php

        public function index(\Illuminate\Http\Request $request, $category1 = '', $category2 = '')
        {
            if( \Illuminate\Support\Facades\Auth::check() && !auth()->user()->hasRole('user') )
            {
                return redirect()->route('backend.dashboard');
            }
            if( !\Illuminate\Support\Facades\Auth::check() && false )
            {
                return redirect()->route('frontend.auth.login');
            }
            $categories = [];
            $game_ids = [];
            $cat1 = false;
            $is_game_page = true;
            $title = trans('app.games');
            $body = '';
            $keywords = '';
            $description = '';
            $shop_id = (\Illuminate\Support\Facades\Auth::check() ? auth()->user()->shop_id : 1);
            $shop = \VanguardLTE\Shop::find($shop_id);
---
select * from `w_shops` where `w_shops`.`id` = 1 limit 1

            \Illuminate\Support\Facades\Cookie::queue('currentCategory' . (\Illuminate\Support\Facades\Auth::check() ? auth()->user()->id : 0), $category1, 2678400);
            if( $category1 != '' )
            {
                $cat1 = \VanguardLTE\Category::where(['href' => $category1])->first();
---
select * from `w_categories` where (`href` = 'all') limit 1

                    'hot'
                ]) )
                {
                    $categories = \VanguardLTE\Category::where(['parent' => 0])->pluck('id')->toArray();
                }
                else
                {
                    $categories = \VanguardLTE\Category::where(['parent' => $cat1->id])->pluck('id')->toArray();
---
select `id` from `w_categories` where (`parent` = 0)
select `id` from `w_categories` where (`parent` = 3)

                }
            }
            $games = $games->get();
            $jpgs = \VanguardLTE\JPG::where('shop_id', $shop_id)->get();
            $jpgSum = \VanguardLTE\JPG::where('shop_id', $shop_id)->sum('balance');
---
select * from `w_jpg` where `shop_id` = 1
select sum(`balance`) as aggregate from `w_jpg` where `shop_id` = 1

                ])->pluck('original_id'))->groupBy('category_id')->pluck('category_id');
                if( count($cat_ids) )
                {
                    $categories = \VanguardLTE\Category::whereIn('id', $cat_ids)->orderBy('position', 'ASC')->get();
---
select * from `w_categories` where `id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 24, 25, 26, 27, 28, 29, 30, 31, 34, 35, 37) order by `position` asc

            {
                $currentSliderNum = 'hot';
            }
            $tournament = \VanguardLTE\Tournament::where('shop_id', $shop_id)->where('start', '<=', \Carbon\Carbon::now())->where('end', '>=', \Carbon\Carbon::now())->orderBy('end', 'ASC')->first();
---
select * from `w_tournaments` where `shop_id` = 1 and `start` <= '2022-09-07 05:23:26' and `end` >= '2022-09-07 05:23:26' order by `end` asc limit 1

            $depositlist = array();
            if(isset(auth()->user()->id))
            {
                $gamestat = \VanguardLTE\StatGame::where('user_id', auth()->user()->id)->orderByDesc('date_time')->limit(50)->get();
                $depositlist = \VanguardLTE\Payment::where('user_id', auth()->user()->id)->orderByDesc('id')->limit(50)->get();
---
select * from `w_stat_game` where `user_id` = 181 order by `date_time` desc limit 50
select * from `w_payments` where `user_id` = 181 order by `id` desc limit 50

        public function check_redirect(\Illuminate\Http\Request $request, $category1, $error = '')
        {
            $shop_id = (\Illuminate\Support\Facades\Auth::check() ? auth()->user()->shop_id : 0);
            if( $category1 == '' )
            {
                if( $currentCategory = $request->cookie('currentCategory' . (\Illuminate\Support\Facades\Auth::check() ? auth()->user()->id : 0)) )
                {
                    $category = \VanguardLTE\Category::where(['href' => $currentCategory])->first();
---
select * from `w_categories` where (`href` = 'all') limit 1

        public function search(\Illuminate\Http\Request $request)
        {
            if( \Illuminate\Support\Facades\Auth::check() && !auth()->user()->hasRole('user') )
            {
                return redirect()->route('backend.dashboard');
            }
            if( !\Illuminate\Support\Facades\Auth::check() )
            {
				// Comment for visitor search @SeachUpdate_v0.1
                // return redirect()->route('frontend.auth.login');
            }
            $categories = [];
            $shop_id = (\Illuminate\Support\Facades\Auth::check() ? auth()->user()->shop_id : 0);
            $shop = \VanguardLTE\Shop::find($shop_id);
---
select * from `w_shops` where `w_shops`.`id` = 1 limit 1