casino/app/Lib/Banker.php

select * from `w_game_bank` where (`shop_id` = 1) limit 1
---
    public static function get_bank($shop_id, $bank){

        if( $bank == 'fish' ){
            $fish = FishBank::where(['shop_id' => $shop_id])->first();
            if($fish){
                return $fish->fish;
            }
        } else {
            $banker = GameBank::where(['shop_id' => $shop_id])->first();