casino/app/Lib/GetHotNewMyGames.php

    public static function get_my_games($finded = false){

        $my_games_stat = StatGame::where('user_id', (isset(auth()->user()->id) ? auth()->user()->id : 0))->groupBy('game')->take(20)->pluck('game');
        if($my_games_stat){
            $my_games = Game::where(['view' => 1, 'shop_id' => (isset(auth()->user()->shop_id) ? auth()->user()->shop_id : 1)])->whereIn('name', $my_games_stat);
            $detect = new MobileDetect;
            if( $detect->isMobile() || $detect->isTablet() ){
                $my_games = $my_games->whereIn('device', [0,2]);
            }else{
                $my_games = $my_games->whereIn('device', [1,2]);
            }
            $my_games = $my_games->take(20)->pluck('id');
---
select `game` from `w_stat_game` where `user_id` = 181 group by `game` limit 20
select `id` from `w_games` where (`view` = 1 and `shop_id` = 1) and `name` in ('AgeOfEgyptPTM', 'AmericanGangsterGTM', 'BananasGoBahamasDX', 'BlueHeartEGT', 'BookOfMagicEGT', 'BurningHot100EGT', 'CaramelHotEGT', 'DiceAndRoll40EGT', 'FishHunterKA', 'JackpotSevensNG', 'LeprechaunGoesWildPG', 'LeprechaunGoesWildPG JPG 18', 'LuckyLeprechaunISB', 'RingOfOdinPG', 'SweetAlchemyBingoPG', 'TheWolfsBaneNET', 'TrollHunters2PG', 'TrollHunters2PG FG', 'VikingsNET') and `device` in (1, 2) limit 20