casino/app/Lib/Setting.php

select * from `w_payment_settings` where (`system` = 'coinbase' and `field` = 'api_key' and `shop_id` = 1) limit 1
---
    public static function is_available($system, $shop_id){

        foreach(config('payments.'.$system.'.required') AS $field){
            $setting = PaymentSetting::where(['system' => $system, 'field' => $field, 'shop_id' => $shop_id])->first();